# 다음 문제를 풀이하시오.

### Q1. pandas 모듈을 pd로, numpy 모듈을 np로 불러오시오.

In [1]:
import pandas as pd
import numpy as np

### Q2. "class_scores.csv"를 pandas 모듈을 활용하여 불러오고 객체 종류를 확인하시오
(단, df 객체에 저장하시오)

In [2]:
df = pd.read_csv("class_scores.csv")

### Q3. df의 첫 3개 row를 출력하시오

In [ ]:
df.head(3)

### Q4. df의 마지막 2개 row를 출력하시오

In [ ]:
df.tail(2)

### Q5. df의 차원을 확인하시오

In [ ]:
df.ndim

### Q6. df의 row 개수를 확인하시오

In [ ]:
len(df)

### Q7. df의 column 개수를 확인하시오

In [ ]:
df.shape[1]

### Q8. df의 column 이름을 확인하시오

In [3]:
df.columns

Index(['Stu_ID', 'grade', 'class', 'gender', 'Math', 'English', 'Science',
       'Marketing', 'Writing'],
      dtype='object')

### Q9. 2학년의 학번, 학년, 성적 전체를 추출하여 df_sub 객체에 저장하시오.

In [4]:
df_sub = df.loc[df["grade"] == 2, ].drop(columns = ["class", "gender"])
df_sub.head(1)

     Stu_ID  grade  Math  English  Science  Marketing  Writing
200   20101      2    57       68       98         88       40
201   20102      2    94       33       32         44       90

In [6]:
# df_sub = df.loc[df["grade"] == 2, df.columns[[0, 1, 4, 5, 6, 7, 8]]]
df_sub = df.loc[df["grade"] == 2, df.columns[np.r_[:2, 4:9]]]
df_sub.head(1)

     Stu_ID  grade  Math  English  Science  Marketing  Writing
200   20101      2    57       68       98         88       40

### Q10. df_sub를 기준으로 학생 개개인의 성적 평균을 계산하고 학번과 같이 "score_avg.csv"로 저장하시오.

In [10]:
# df_sub.mean(axis = 1)
# df_sub.iloc[:, 2:].mean(axis = 1)
df_sub["mean"] = df_sub.iloc[:, 2:].mean(axis = 1)
df_sub.head(2)

     Stu_ID  grade  Math  English  Science  Marketing  Writing  mean
200   20101      2    57       68       98         88       40  70.2
201   20102      2    94       33       32         44       90  58.6

In [12]:
df_mean = pd.DataFrame({"Stu_ID": df_sub["Stu_ID"],
                        "mean": df_sub.iloc[:, 2:9].mean(axis = 1)})
df_mean.head(2)

     Stu_ID  mean
200   20101  70.2
201   20102  58.6

In [ ]:
df_mean.to_csv("class_score_mean.csv", index = False)

### Q11. df_sub를 기준으로 과목별 성적 최고점, 최저점, 표준편차를 계산하고 과목명과 함께 score_stat에 저장하시오.

In [19]:
df_sub.columns[2:7]

Index(['Math', 'English', 'Science', 'Marketing', 'Writing'], dtype='object')

In [20]:
score_stat = pd.DataFrame({"subject": df_sub.columns[2:7],
                           "score_max": df_sub.iloc[:, 2:7].max(),
                           "score_min": df_sub.iloc[:, 2:7].min(),
                           "score_std": df_sub.iloc[:, 2:7].std()})
score_stat

             subject  score_max  score_min  score_std
Math            Math        100         25  21.966154
English      English        100         25  20.638307
Science      Science        100         25  23.344244
Marketing  Marketing        100         25  22.021939
Writing      Writing        100         25  21.772637

In [23]:
# df_sub.iloc[:, 2:7].agg(["max", "min", "std"])
# df_sub.iloc[:, 2:7].agg(["max", "min", "std"]).transpose()
df_sub.iloc[:, 2:7].agg(["max", "min", "std"]).transpose().reset_index()

       index    max   min        std
0       Math  100.0  25.0  21.966154
1    English  100.0  25.0  20.638307
2    Science  100.0  25.0  23.344244
3  Marketing  100.0  25.0  22.021939
4    Writing  100.0  25.0  21.772637

### Q12. score_stat의 index를 0 ~ 4로 만드시오.

In [24]:
score_stat = score_stat.reset_index(drop = True) # 기존 index에 있던 정보를 버림
score_stat

     subject  score_max  score_min  score_std
0       Math        100         25  21.966154
1    English        100         25  20.638307
2    Science        100         25  23.344244
3  Marketing        100         25  22.021939
4    Writing        100         25  21.772637

### Q13. score_stat 객체를 "score_stat.csv"로 저장하시오.

In [ ]:
score_stat.to_csv("score_stat.csv", index = False)